Revit 2024 API
FamilyLoadingIntoDocumentEventArgs.FamilyPath Property
 The file path of the family that is being loaded into the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string FamilyPath { get; }
Visual Basic
Public ReadOnly Property FamilyPath As String
	Get
Visual C++
public:
property String^ FamilyPath {
	String^ get ();
}
See Also
FamilyLoadingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace